<h1>Connect to and query PostgreSQL database using odbc</h1>

vedi: https://db.rstudio.com/databases/postgresql, https://www.tidyverse.org/blog/2019/12/odbc-1-2-0/

<h3>Load packages (<code>odbc</code>)</h3>

In [62]:
library(odbc)

<h3>Define constants</h3>

In [63]:
your_driver_path <- "/usr/local/Caskroom/miniconda/base/envs/data-science/lib/psqlodbca.so"
your_server_path   <- "/tmp"
your_database_name <- "sqlda"
# database_user <- rstudioapi::askForPassword("Database user")
# database_password <- rstudioapi::askForPassword("Database password")
database_user <- "francescoghizzo"
database_password <- NULL

<h3>Connect</h3>

In [64]:
con <- DBI::dbConnect(odbc::odbc(),
                      Driver   = your_driver_path,
                      Server   = your_server_path,
                      Database = your_database_name,
                      UID      = database_user,
                      PWD      = database_password,
                      Port     = 5432)

In [65]:
con

<OdbcConnection> francescoghizzo@/tmp
  Database: sqlda
  PostgreSQL Version: 14.0.2

<h3>Load packages (<code>DBI</code>)</h3>

In [66]:
library(DBI)

<h3>Define constants</h3>

In [67]:
your_driver_path <- "/usr/local/Caskroom/miniconda/base/envs/data-science/lib/psqlodbca.so"
your_server_path   <- "/tmp"
your_database_name <- "sqlda"
# database_user <- rstudioapi::askForPassword("Database user")
# database_password <- rstudioapi::askForPassword("Database password")
database_user <- "francescoghizzo"
database_password <- NULL

<h3>Connect</h3>

In [68]:
con <- dbConnect(odbc::odbc(),
                      Driver   = your_driver_path,
                      Server   = your_server_path,
                      Database = your_database_name,
                      UID      = database_user,
                      PWD      = database_password,
                      Port     = 5432)

In [69]:
con

<OdbcConnection> francescoghizzo@/tmp
  Database: sqlda
  PostgreSQL Version: 14.0.2

<h3>Query</h3>

<h4>List of relations</h4>

In [70]:
query <- " SELECT table_schema, table_name, table_type  FROM information_schema.tables WHERE table_schema='public' "

In [71]:
dbGetQuery(con, query)

   table_schema table_name                   table_type
1  public       closest_dealerships          BASE TABLE
2  public       countries                    BASE TABLE
3  public       customer_sales               BASE TABLE
4  public       customer_survey              BASE TABLE
5  public       customers                    BASE TABLE
6  public       dealerships                  BASE TABLE
7  public       emails                       BASE TABLE
8  public       products                     BASE TABLE
9  public       public_transportation_by_zip BASE TABLE
10 public       sales                        BASE TABLE
11 public       salespeople                  BASE TABLE
12 public       top_cities_data              BASE TABLE
13 public       internet                     BASE TABLE
14 public       managers                     BASE TABLE

<h4>Print Table</h4>

In [72]:
query <- "SELECT * FROM products"

In [73]:
dbGetQuery(con, query)

   product_id model                 year product_type base_msrp
1   1         Lemon                 2010 scooter         399.99
2   2         Lemon Limited Edition 2011 scooter         799.99
3   3         Lemon                 2013 scooter         499.99
4   5         Blade                 2014 scooter         699.99
5   7         Bat                   2016 scooter         599.99
6   8         Bat Limited Edition   2017 scooter         699.99
7  12         Lemon Zester          2019 scooter         349.99
8   4         Model Chi             2014 automobile   115000.00
9   6         Model Sigma           2015 automobile    65500.00
10  9         Model Epsilon         2017 automobile    35000.00
11 10         Model Gamma           2017 automobile    85750.00
12 11         Model Chi             2019 automobile    95000.00
   production_start_date production_end_date
1  2010-03-03            2012-06-08
2  2011-01-03            2011-03-30
3  2013-05-01            2018-12-28
4  2014-06-23            2015-01-27
5  2016-10-10            <NA>
6  2017-02-15            <NA>
7  2019-02-04            <NA>
8  2014-06-23            2018-12-28
9  2015-04-15            2018-10-01
10 2017-02-15            <NA>
11 2017-02-15            <NA>
12 2019-02-04            <NA>

In [74]:
query <- "SELECT * FROM dealerships"

In [75]:
dbGetQuery(con, query)

   dealership_id street_address             city         state postal_code
1   1            52 Hillside Terrace        Millburn     NJ    07039
2   2            808 South Hobart Boulevard Los Angeles  CA    90005
3   3            16801 Lee Road             Houston      TX    77032
4   4            2437 NW 28th Street        Miami        FL    33242
5   5            2210 Bunker Hill Drive     San Mateo    CA    94402
6   6            7315 California Avenue     Seattle      WA    98136
7   7            3650 Gunston Road          Arlington    VA    22202
8   8            5938 Cornfoot Road         Portland     OR    97218
9   9            2340 NV-648                Reno         NV    89595
10 10            7425 Wilson Avenue         Chicago      IL    60706
11 11            1520 Perry Boulevard       Atlanta      GA    30318
12 12            1900 Delaney Avenue        Orlando      FL    32856
13 13            1225 Florida Boulevard     Jacksonville FL    32266
14 14            800 North Mays Street      Round Rock   TX    78664
15 15            14301 Caribbean Lane       Phoenix      AZ    85383
16 16            900 Rocky River Road       Charlotte    NC    28126
17 17            2120 Walnut Street         Philadelphia PA    19092
18 18            1447 Hardesty Avenue       Kansas City  MO    64195
19 19            4311 San Jacinto Street    Dallas       TX    75201
20 20            50 Worthington Road        Boston       MA    02123
   latitude longitude  date_opened date_closed
1  40.79285  -74.32329 2014-06-01  <NA>
2  34.05775 -118.30542 2014-06-01  <NA>
3  29.96350  -95.30702 2014-06-01  <NA>
4  25.80175  -80.23645 2014-06-01  <NA>
5  37.52449 -122.34361 2014-06-01  <NA>
6  47.53796 -122.38729 2014-06-01  <NA>
7  38.83918  -77.07974 2014-06-01  <NA>
8  45.57570 -122.60298 2014-06-01  <NA>
9  39.52768 -119.77571 2014-06-01  <NA>
10 41.96347  -87.81360 2014-06-01  <NA>
11 33.78965  -84.43930 2014-06-01  <NA>
12 28.52072  -81.37223 2014-06-01  <NA>
13 30.31603  -81.41016 2014-06-01  <NA>
14 30.51548  -97.68191 2014-06-01  <NA>
15 33.62380 -112.36994 2014-06-01  <NA>
16 35.28334  -80.74763 2014-06-01  <NA>
17 39.95095  -75.17705 2014-06-01  <NA>
18 39.09567  -94.51928 2014-06-01  <NA>
19 32.80121  -96.78200 2014-06-01  <NA>
20 42.34905  -71.11338 2014-06-01  <NA>

In [78]:
query <- "SELECT * FROM sales WHERE channel='dealership' ORDER BY sales_transaction_date DESC LIMIT 20"

In [79]:
dbGetQuery(con, query)

   customer_id product_id sales_transaction_date sales_amount channel
1  40546        7         2019-05-31 22:15:30      599.990    dealership
2  23659        7         2019-05-31 18:21:21      479.992    dealership
3    536       10         2019-05-31 17:30:04    68600.000    dealership
4  14824       12         2019-05-31 17:01:04      349.990    dealership
5  44921        8         2019-05-31 15:08:03      559.992    dealership
6  14925        7         2019-05-31 08:55:52      599.990    dealership
7   4279       12         2019-05-31 08:26:07      349.990    dealership
8  29384       10         2019-05-31 08:24:31    85750.000    dealership
9  47303       12         2019-05-31 07:37:10      349.990    dealership
10 48830       12         2019-05-31 03:40:05      314.991    dealership
11  9826        8         2019-05-31 00:48:24      629.991    dealership
12 20527       12         2019-05-30 23:25:58      349.990    dealership
13 15093        7         2019-05-30 22:46:58      599.990    dealership
14 30644       12         2019-05-30 21:49:26      349.990    dealership
15 44241        8         2019-05-30 21:37:17      559.992    dealership
16  7041        9         2019-05-30 21:25:48    35000.000    dealership
17 48572        8         2019-05-30 18:36:58      699.990    dealership
18 49453        8         2019-05-30 14:12:09      629.991    dealership
19 47145        8         2019-05-30 12:01:43      699.990    dealership
20 12634       12         2019-05-30 10:36:42      349.990    dealership
   dealership_id
1  11
2   4
3   4
4  17
5   3
6   5
7  17
8   7
9  18
10 19
11  8
12 19
13 14
14 12
15 11
16 18
17 17
18 18
19  1
20 17